Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.3.82/svd/ATSAML10D14A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>NVIC</name>
         <description>Nested Vectored Interrupt Controller</description>
         <groupName>NVIC</groupName>
         <prependToName>NVIC_</prependToName>
         <baseAddress>0xE000E100</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x348</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>NVIC_ISER[%s]</name>
               <description>Interrupt Set Enable Register n</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>Set enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>NVIC_ICER[%s]</name>
               <description>Interrupt Clear Enable Register n</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>Clear enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>NVIC_ISPR[%s]</name>
               <description>Interrupt Set Pending Register n</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>Set pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>NVIC_ICPR[%s]</name>
               <description>Interrupt Clear Pending Register n</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>Clear pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>NVIC_IABR[%s]</name>
               <description>Interrupt Active Bit Register n</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>Active state</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>NVIC_ITNS[%s]</name>
               <description>Interrupt Target Non-secure Register n</description>
               <addressOffset>0x280</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ITNS</name>
                     <description>Interrupt Targets Non-secure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>12</dim>
               <dimIncrement>4</dimIncrement>
               <name>NVIC_IPR[%s]</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x300</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRI_N0</name>
                     <description>Priority of interrupt number 4n+0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_N1</name>
                     <description>Priority of interrupt number 4n+1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_N2</name>
                     <description>Priority of interrupt number 4n+2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_N3</name>
                     <description>Priority of interrupt number 4n+3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SCB</name>
         <description>System Control Block</description>
         <groupName>SCB</groupName>
         <prependToName>SCB_</prependToName>
         <baseAddress>0xE000ED00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x88</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CPUID</name>
               <description>CPUID base register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>Revision</name>
                     <description>Revision number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PartNo</name>
                     <description>Part number, 0xD20=Cortex-M23</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>Architecture</name>
                     <description>Architecture version, 0xC=ARMv8-M Base Line, 0xF=ARMv8-M Main Line</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>Variant</name>
                     <description>Variant number</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>Implementer</name>
                     <description>Implementer code, ARM=0x41</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICSR</name>
               <description>Interrupt Control and State Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VECTACTIVE</name>
                     <description>Vector active</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>RETTOBASE</name>
                     <description>Return to base</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VECTPENDING</name>
                     <description>Vector pending</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>ISRPENDING</name>
                     <description>Interrupt pending</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISRPREEMPT</name>
                     <description>Interrupt preempt</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDSTCLR</name>
                     <description>Pend SysTick clear</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PENDSTCLRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>Removes the pending state from the SysTick exception</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PENDSTSET</name>
                     <description>Pend SysTick set</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PENDSTSETSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>Write: no effect; read: SysTick exception is not pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>Write: changes SysTick exception state to pending; read: SysTick exception is pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PENDSVCLR</name>
                     <description>Pend PendSV clear</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PENDSVCLRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>Removes the pending state from the PendSV exception</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PENDSVSET</name>
                     <description>Pend PendSV set</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PENDSVSETSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>Write: no effect; read: PendSV exception is not pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>Write: changes PendSV exception state to pending; read: PendSV exception is pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PENDNMICLR</name>
                     <description>Pend NMI clear</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDNMISET</name>
                     <description>Pend NMI set</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PENDNMISETSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>Write: no effect; read: NMI exception is not pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>Write: changes NMI exception state to pending; read: NMI exception is pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>VTOR</name>
               <description>Vector Table Offset Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TBLOFF</name>
                     <description>Vector table base offset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>25</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIRCR</name>
               <description>Application Interrupt and Reset Control Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VECTCLRACTIVE</name>
                     <description>Debug: Clear Active State</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VECTCLRACTIVESelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Do not clear active state</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Clear active state</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYSRESETREQ</name>
                     <description>System Reset Request</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SYSRESETREQSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Do not request a system reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Request a system reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYSRESETREQS</name>
                     <description>System Reset Request Secure only</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SYSRESETREQSSelect</name>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>SYSRESETREQ functionality is available to both Security states</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SECURE</name>
                           <description>SYSRESETREQ functionality is only available to Secure state</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BFHFNMINS</name>
                     <description>BusFault, HardFault and NMI Non-secure enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BFHFNMINSSelect</name>
                        <enumeratedValue>
                           <name>SECURE</name>
                           <description>BusFault, HardFault, and NMI are Secure</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NON_SECURE</name>
                           <description>BusFault and NMI are Non-secure and exceptions can target Non-secure HardFault</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRIS</name>
                     <description>Prioritize Secure Exceptions</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRISSelect</name>
                        <enumeratedValue>
                           <name>SAME</name>
                           <description>Priority ranges of Secure and Non-secure exceptions are identical</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NS_DEPRIO</name>
                           <description>Non-secure exceptions are de-prioritized</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENDIANNESS</name>
                     <description>Data Endianness, 0=little, 1=big</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENDIANNESSSelect</name>
                        <enumeratedValue>
                           <name>LITTLE</name>
                           <description>Little-endian</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIG</name>
                           <description>Big-endian</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VECTKEY</name>
                     <description>Register Key (0x05FA)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
